; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image2 - mode
	infrared1 - mode
	infrared3 - mode
	spectrograph0 - mode
	GroundStation2 - direction
	Star0 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument3 image2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 infrared1)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet12)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite2 Phenomenon9)
	(pointing satellite3 Star13)
	(have_image Planet7 infrared1)
	(have_image Phenomenon8 image2)
	(have_image Phenomenon9 image2)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 image2)
	(have_image Star13 infrared3)
	(have_image Phenomenon14 image2)
))

)

; plan
1. (turn_to satellite2 groundstation5 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 11
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 11
3. (calibrate satellite2 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 0 of 11
4. (turn_to satellite2 star13 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 star13)
   goals met: 0 of 11
5. (take_image satellite2 star13 instrument4 infrared3)
   added: (have_image star13 infrared3)
   goals met: 1 of 11
6. (turn_to satellite2 planet11 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 planet11)
   goals met: 1 of 11
7. (take_image satellite2 planet11 instrument4 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 11
8. (turn_to satellite2 planet10 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet10)
   goals met: 2 of 11
9. (take_image satellite2 planet10 instrument4 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 3 of 11
10. (turn_to satellite2 groundstation1 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 groundstation1)
   goals met: 3 of 11
11. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 3 of 11
12. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 3 of 11
13. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 3 of 11
14. (turn_to satellite0 star3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star3)
   goals met: 4 of 11
15. (turn_to satellite2 phenomenon14 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon14)
   goals met: 4 of 11
16. (take_image satellite2 phenomenon14 instrument5 image2)
   added: (have_image phenomenon14 image2)
   goals met: 5 of 11
17. (turn_to satellite2 phenomenon8 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon8)
   goals met: 5 of 11
18. (take_image satellite2 phenomenon8 instrument5 image2)
   added: (have_image phenomenon8 image2)
   goals met: 6 of 11
19. (turn_to satellite2 planet12 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet12)
   goals met: 6 of 11
20. (take_image satellite2 planet12 instrument5 image2)
   added: (have_image planet12 image2)
   goals met: 7 of 11
21. (turn_to satellite2 planet7 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet7)
   goals met: 7 of 11
22. (take_image satellite2 planet7 instrument5 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 8 of 11
23. (turn_to satellite2 phenomenon9 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon9)
   goals met: 9 of 11
24. (take_image satellite2 phenomenon9 instrument5 image2)
   added: (have_image phenomenon9 image2)
   goals met: 10 of 11
25. (turn_to satellite3 star13 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 star13)
   goals met: 11 of 11
